<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="en">
<head>
	<title>Operation Cleaner 2 - Opas</title>
	<link rel="stylesheet" href="oc2style.css" type="text/css">	
	<meta name="author" content="Jan Nyman">
	<meta name="description" content="Operation Cleaner 2 manual">
	<meta name="keywords" content="Operation Cleaner 2 manual">
</head>

<div class="left">

<p>
<B><a href="#gamemenus">VALIKOT</a></B><BR>
- <a href="#main">P&Auml;&Auml;VALIKKO</a><br>
- <a href="#settings">ASETUKSET</a><br>
- <a href="#ingame">PELIVALIKOT</a><br>
- <a href="#financial">TALOUDELLISET P&Auml;&Auml;T&Ouml;KSET</a><br>

<B><a href="#readying">VALMISTELU</a></B><BR>
- <a href="#explosives">R&Auml;J&Auml;HTEIDEN ASETTELU</a></b><br>
- <a href="#dampers">SUOJIEN ASETTELU</a></b><br>
- <a href="#tips">YLEISI&Auml; OHJEITA</a><br>
- <a href="#keys">N&Auml;PP&Auml;IMET</a><br>

<B><a href="#system">J&Auml;RJESTELM&Auml;VAATIMUKSET</a></B><BR>

<a href="#prob">TUNNETUT ONGELMAT</a><br>

<a href="#tm">TAVARAMERKIT</a><br>

<a href="#credits">KIITOKSET</a><br>

<p>
TEHTY
<br>
5.11.2005
<p>
Tekij&auml;: <a href="mailto:jan.nyman@mbnet.fi">Jan Nyman</a>
<p>
Suositeltava n&auml;ytt&ouml;tarkkuus 800x600 tai suurempi.

</div>

<div class="mid">
<center>
<img border=0 src="media/oc2title.gif" width=300 height=100 alt="Operation Cleaner 2 logo"></a><p>
<h1>OPAS</H1>
<h3>Versio 1.2 (fi)</h3>
</center>

<H2>YLEIST&Auml;</h2>
Pelin tarkoituksena on purkaa rakennuksia ja pit&auml;&auml; yritys kannattavana. Ty&ouml;ss&auml; on paljon kuluja esimerkiksi r&auml;j&auml;hteist&auml;, ty&ouml;miehist&auml;, maansiirtokoneista, veroista, kirjanpit&auml;jist&auml; ja vakuutuksista.

<p>
Viimeisimm&auml;t uutiset ja tiedot l&ouml;ytyv&auml;t <a href="http://koti.mbnet.fi/jnyman/cleaner2/" target="blank">The Operation Cleaner 2 verkkosivulta </a> (englanniksi, aukeaa uuteen ikkunaan).

<H2><a name="gamemenus">VALIKOT</H2>

<a name="main">
<h4>P&Auml;&Auml;VALIKKO</H4>
<ul>
<li><b>Pikapeli</b> - Suoraan toimintaan satunnaisella kartalla
<li><b>Kartan nro/teksti:</b> - Voit sy&ouml;tt&auml;&auml; numeron tai tekstin jonka perusteella luodaan satunnaiskartta. Vasemmanpuoleinen listasta voi valita halutun tyyppisen kohderakennuksen.
<li><b>Lataa kartta</b> - Editorissa tehdyn kartan lataus
<li><b>Aloita ura</b> - Pelaa etuk&auml;teen valittuja kaupunkeja ja karttoja uramoodissa
<li><b>Lataa peli</b> - Pelin lataus ja tallennus
<li><b>Huipputulokset</b> - Parhaat tulokset n&auml;kyv&auml;t t&auml;&auml;ll&auml;
<li><b>Asetukset</b> - Muuta pelin asetuksia
<li><b>Tietoja</b> - Kiitokset ja yleist&auml; tietoa
<li><b>Lopeta</b> - Lopeta ohjelma
</ul>

<h4><a name="settings">ASETUKSET</h4>
<ul>
<li><b>&Auml;&auml;net</b> - &Auml;&auml;net p&auml;&auml;lle tai pois
<li><b>N&auml;yt&auml; r&auml;j&auml;hdykset</b> - R&auml;j&auml;hdykset n&auml;kyviin tai ei
<li><b>N&auml;yt&auml; p&ouml;ly</b> - P&ouml;ly n&auml;kyviin tai ei, voi nopeuttaa piirtoa jos pois p&auml;&auml;lt&auml;
<li><b>Vaikeustaso</b> - Oletusvaikeustason s&auml;&auml;t&ouml;. Vaikutukset n&auml;kyv&auml;t peliss&auml; oikeanpuoleisessa listassa.
<li><b>Ulkoasu</b> - T&auml;st&auml; valikosta voit vaihtaa pelin ulkoasua
<li><b>Erottelukyky</b> - Peli k&auml;ynnist&auml;&auml; grafiikkapuolen uudestaan jos erottelukyky&auml; vaihdetaan ja asetukset tallennetaan
<li><b>V&auml;rim&auml;&auml;r&auml;/bitti&auml;</b> - Peli k&auml;ynnist&auml;&auml; grafiikkapuolen uudestaan jos v&auml;rim&auml;&auml;r&auml;&auml; vaihdetaan ja asetukset tallennetaan. 16-bittinen on huomattavasti nopeampi kuin 32-bittinen.
<li><b>Vieritys</b> - Vieritysnopeus. Jos asetus on Ei, oikea hiirenpainike siirt&auml;&auml; kursorin alla olevan kohdan ruudun keskelle. Muutoin ruutu vierii uuteen keskikohtaan.
</ul>

<h4><a name="ingame">PELIVALIKOT</h4>
T&auml;m&auml; osuus k&auml;sittelee oikeanpuoleista valikkoa varsinaisen pelin aikana.
<ul>
<li><i>R&auml;j&auml;hteet-valikko</i> - T&auml;st&auml; valitaan k&auml;ytett&auml;v&auml; r&auml;j&auml;hdetyyppi
</ul>

<p>Seuraavalla painikkeella on kolme toimintoa:
<ul>
<li><b>Lis&auml;&auml;</b> - Aseta r&auml;j&auml;hdepanos kartalle.
<li><b>Valitse</b> - Valitse r&auml;j&auml;hdepanos kartalta.
<li><b>Siirr&auml;</b> - Siirr&auml; valittua r&auml;j&auml;hdepanos kartalla toiseen paikkaan.
</ul>
<p>

<ul>
<li><b>Poista</b> - Poista valittu r&auml;j&auml;hdepanos
<li><b>R&auml;j.val.</b> - R&auml;j&auml;yt&auml; valittu r&auml;j&auml;hdepanos

<li><b>Yksik&ouml;n koko</b> - R&auml;j&auml;hteen m&auml;&auml;r&auml; panoksessa
<li><b>Viive</b> - R&auml;j&auml;hdepanoksen viive
<li><b>Suunta</b> - R&auml;j&auml;hdepanoksen suunta (r&auml;j&auml;hdyksen keila on 90 astetta)

<li><b>Nalleja</b> - Jokainen r&auml;j&auml;hdepanos k&auml;ytt&auml;&auml; yhden nallin
<li><b>Laukaisimia</b> - Jokainen r&auml;j&auml;ytys k&auml;ytt&auml;&auml; yhden laukaisimen
<li><b>Sytytyslankaa</b> - Mit&auml; korkeammalla r&auml;j&auml;hdepanos on maasta, sen enemm&auml;n sytytyslankaa kuluu
<li><b>Suojia</b> - Suojaavat naapurirakennuksia mutta lis&auml;&auml;v&auml;t kuluja

<li><b>Valmisteluihin kuluu</b> - Kuinka kauan aikaa kuluu valmisteluihin. Suurempi r&auml;j&auml;hdem&auml;&auml;r&auml; vie enemm&auml;n aikaa
<li><b>Kulut yhteens&auml;</b> - T&auml;m&auml;nhetkisen r&auml;j&auml;ytyssuunnitelman toteutumiskulut
<li><b>Rahaa</b> - K&auml;ytett&auml;viss&auml; oleva raha

<li><b>R&auml;j&auml;yt&auml;</b> - R&auml;j&auml;ytt&auml;&auml; kaikki r&auml;j&auml;hdepanokset
</ul>
<p>
Seuraava painike vaikuttaa hiiren vasemman painikkeen toimintoon kartalla:
<ul>
<li><b>R&auml;j.asetus</b> - Lis&auml;&auml; r&auml;j&auml;hdepanoksen kartalle
<li><b>Suojien asetus</b> - Lis&auml;&auml; suojia kartalle, ja r&auml;j&auml;hdyken arvioitu vaikutusalue on n&auml;kyviss&auml;
</ul>
<p>

<ul>
<li><b>Pienempi/Suurempi</b> - Vaihda n&auml;kym&auml;&auml; l&auml;hemm&auml;s tai kauemmas
<li><b>Keskeyt&auml; ty&ouml;</b> - Jos haluat ohittaa t&auml;m&auml;n ty&ouml;maan, paina t&auml;st&auml; ja varmista keskeytys.
<li><b>P&auml;&auml;t&auml; ty&ouml;maa</b> - Kun kohderakennus on vaurioitunut, t&auml;m&auml; painike on n&auml;kyviss&auml;. Uusia r&auml;j&auml;ytyksi&auml; voi viel&auml; kuitenkin tarvittaessa tehd&auml;
<li><b>Satunn. kartta</b> - Satunnainen kartta
<li><b>Kartan nro</b> - Voit sy&ouml;tt&auml;&auml; numeron tai tekstin jonka perusteella luodaan satunnaiskartta
<li><b>Tallennus &amp; Lataus</b> - Pelin lataus ja tallennus
<li><b>Exit to main menu</b> - Paluu p&auml;&auml;valikkoon josta voi palata peliin, keskeytt&auml;&auml; pelin tai lopettaa ohjelman
</ul>

<h4><a name="financial">TALOUDELLISET P&Auml;&Auml;T&Ouml;KSET</H4>
T&auml;st&auml; valikossa voi s&auml;&auml;t&auml;&auml; ty&ouml;ntekij&ouml;iden m&auml;&auml;r&auml;&auml; ja seurata tilastotietoja.

<ul>
<li>Ty&ouml;ntekij&ouml;iden m&auml;&auml;r&auml; vaikuttaa valmisteluun ja siivoamiseen k&auml;ytett&auml;v&auml;&auml;n aikaan. Ty&ouml;miehi&auml; on oltava v&auml;hint&auml;&auml;n maansiirtokoneiden tai rekkojen enimm&auml;ism&auml;&auml;r&auml;n verran.
<li>Maansiirtokoneet ja rekat vaikuttavat siivousaikaan. 
<li>Vartijat vaikuttavat turvallisuuteen ja hoitavat mahdollisia ongelmatilanteita.

</ul>

<p>
<b>Jatkovalinnat</b>
<p>
T&auml;st&auml; valikossa voi muuttaa asetuksiin jotka vaikuttavat kuukausittaisiin kuluihin ja veroihin. Verot maksetaan palkkioista jotka ansaitaan eiv&auml;tk&auml; ole kuukausipohjaisia. Muut kulut ovat kuukausipohjaisia.
<ul>
<li><b>Verot</b> - Jos et maksa tarpeeksi veroja, voi joutua kiinni ja maksamaan enemm&auml;n my&ouml;hemmin.
<li><b>Kirjanpit&auml;j&auml;</b> - Vaikuttaa kirjanpidon luotettavuuteen. Huono kirjanpit&auml;j&auml; voi johtaa tarkastukseen ja lis&auml;kuluihin.
<li><b>Vakuutukset</b> - Kun (ei jos) jotain rikkoutuu, vakuuutus korvaa osan vahingoista
<li><b>Kilpailijat</b> - Jos haluat pelata likaista peli&auml;, t&auml;m&auml; on sit&auml; varten. Joskus voi aiheuttaa kilpailijoille harmia, joskus j&auml;&auml; kiinni ja joutuu maksamaan rikoksista. Mit&auml; enemm&auml;n sabotaasi maksaa, sit&auml; enemm&auml;n se aiheuttaa vahinkoa, mutta kiinnij&auml;&auml;misen riski on my&ouml;s suurempi. Sabotaasin j&auml;lkeen on tietty aika jonka aikana ei voi toteuttaa uutta sabotaasia.
</ul>
<p>

<h2><a name="readying">VALMISTELU</H2>

<a name="explosives">
<h4>R&Auml;J&Auml;HTEIDEN ASETTELU</H4>
<ul>
<li>Valitse sopiva r&auml;j&auml;hdetyyppi
<li>Valitse liukus&auml;&auml;timell&auml; sopiva r&auml;j&auml;hdem&auml;&auml;r&auml;
<li>Viives&auml;&auml;timell&auml; muutetaan r&auml;j&auml;hdepanoksen viivett&auml;
<li>Paina hiiren vasenta nappulaa kartalla halutussa kohdassa, ja r&auml;j&auml;hdepanos on sijoitettu kartalle ja n&auml;kyy neli&ouml;n&auml;.
<li>Jos haluat s&auml;&auml;t&auml;&auml; panoksen suuntaa asettamisen yhteydess&auml;, paina hiiren nappula pohjaan, ved&auml; hiirt&auml; haluttuun suuntaan ja vapauta painike
<li>Asetetun r&auml;j&auml;hdepanoksen voi valita painamalla <b>Lis&auml;&auml;</b>-nappia (jolloin tekstiksi vaihtuu <b>Valitse</b>) sivupaneelissa ja painamalla hiiren vasenta nappulaa halutun panoksen kohdalla. Valittu panos n&auml;ytet&auml;&auml;n eri v&auml;rill&auml; ja painikkeessa lukee <i>Siirr&auml;</i>. Jos haluat siirt&auml;&auml; valittua panosta, paina hiiren nappulaa kartalla. Jos haluat lis&auml;t&auml; uuden panoksen, paina <b>Lis&auml;&auml;</b>-nappia
<li>Jos haluat poistaa valitun panoksen, paina <b>Poista</b>-nappia. Seuraava panos valitaan automaattisesti. 
</ul>

<h4><a name="dampers">SUOJIEN ASETTELU</H4>
<ul>
<li>Ennen r&auml;j&auml;ytyst&auml; on suositeltavaa sijoittaa suojia naapurirakennusten suojaksi. T&auml;m&auml; tehd&auml;&auml;n painamalla nappia <b>R&auml;j.asetus</b> niin ett&auml; tekstiksi vaihtuu <b>Suojien asetus</b>. Paina hiiren vasen painike pohjaan ja ved&auml; hiirt&auml; kartalla, jolloin neli&ouml; n&auml;ytt&auml;&auml; mihin suojia asetetaan. Neli&ouml;n alaosa pit&auml;&auml; olla kosketuksessa maahan, muuten suojia ei aseteta.
<li>Suojia voi poistaa Suojien asetus -moodissa painamalla hiiren vasenta nappulaa kartalla suojan kohdalla. Kaikki suojaan kosketuksissa olevat suojat poistetaan.
</ul>

<h4><a name="tips">YLEISI&Auml; OHJEITA</h4>
<ul>
<li>Yrit&auml; tuhota rakennuksesta niin paljon kuin pystyt niin v&auml;hill&auml; r&auml;j&auml;ytyksill&auml; kuin mahdollista (koska j&auml;tteiden poisto maksaa, ja jokainen r&auml;j&auml;ytys maksaa)
<li>Et&auml;isyys v&auml;hent&auml;&auml; r&auml;j&auml;hdyksen voimaa
<li>Kovat rakennelmat v&auml;hent&auml;v&auml;t enemm&auml;n r&auml;j&auml;hdyksen voimaa kuin esim. ilma. Palikan kesto n&auml;kyy sen nimen alla.
<li>Rakennus voi sortua jos se on tarpeeksi vaurioitunut. T&auml;m&auml; koskee kaikkia rakennuksia, my&ouml;s naapureita
<li>K&auml;yt&auml; suojia jos et ole varma r&auml;j&auml;hdyksen voimasta. On halvempaa maksaa muutamasta suojasta kuin naapuritalojen vaurioista.
<li>Suojien asetus -moodissa n&auml;kyv&auml;t r&auml;j&auml;hteiden <b>arvioidut</b> vaikutusalueet ympyr&ouml;in&auml;. Todellinen vaikutusalue voi poiketa t&auml;st&auml; arviosta suuresti.
<li>Mit&auml; enemm&auml;n vaurioitutta materiaalia on j&auml;ljell&auml;, sit&auml; kauemmin puhdistus kest&auml;&auml;, ja my&ouml;s maksaa enemm&auml;n. Maansiirtokoneiden, rekkojen ja miehist&ouml;n lis&auml;&auml;minen lyhent&auml;&auml; puhdistusaikaa mutta lis&auml;miehist&ouml; maksaa. Voimien tasapainottaminen kannattaa, liian suuri ep&auml;suhta hidastaa ty&ouml;ntekoa. Yksi maansiirtokone ja/tai rekka 10 miest&auml; kohden on suurin kannattava m&auml;&auml;r&auml;
<li>Liikennemerkit, vesipostit ja muut esineet eiv&auml;t kuulu tuhottavien joukkoon ja jos ne vaurioituvat, niist&auml; joutuu maksamaan.
<li>Oikeassa yl&auml;kulmassa on hiiren kursorin alla olevan palikan rahallinen arvo. Vihre&auml; tarkoittaa sen olevan kohdealuetta, punainen taas ei.
</ul>

<h2><a name="keys">N&Auml;PP&Auml;IMET</H2>
<table border>
<tr>
<td bgcolor="#CCCCCC">
N&auml;pp&auml;in
</td>
<td  bgcolor="#CCCCCC">
Toiminto
</td>
</tr>

<tr>
<td><b>+ (plus-merkki)</td><td>Lis&auml;&auml; r&auml;j&auml;hteiden m&auml;&auml;r&auml;&auml; panoksessa
</td></tr><tr><td><b>- (miinus-merkki)</td><td>V&auml;hent&auml;&auml; r&auml;j&auml;hteiden m&auml;&auml;r&auml;&auml; panoksessa
</td></tr><tr><td><b>Page Up</td><td>Lis&auml;&auml; panoksen viivett&auml;
</td></tr><tr><td><b>Page Down</td><td>V&auml;henn&auml; panoksen viivett&auml;
</td></tr><tr><td><b>Up</td><td>Vierit&auml; n&auml;kym&auml;&auml; yl&ouml;s
</td></tr><tr><td><b>Down</td><td>Vierit&auml; n&auml;kym&auml;&auml; alas
</td></tr><tr><td><b>Right</td><td>Vierit&auml; n&auml;kym&auml;&auml; oikealle
</td></tr><tr><td><b>Left</td><td>Vierit&auml; n&auml;kym&auml;&auml; vasemmalle
</td></tr><tr><td><b>Z</td><td>S&auml;&auml;d&auml; n&auml;kym&auml;&auml; l&auml;hemm&auml;s tai kauemmas
</td></tr><tr><td><b>Esc</td><td>Riippuu miss&auml; tilanteessa on:
<ul>
  <li><i>tekstinsy&ouml;tt&ouml;ikkuna</i>: sulkee ikkunan
  <li><i>pelin aikana</i>: palaa p&auml;&auml;valikkoon
  <li><i>p&auml;&auml;valikko</i>: lopettaa ohjelman
 </ul>
</table>

<h2><a name="system">J&Auml;RJESTELM&Auml;VAATIMUKSET</H2>
<ul>
<li>Microsoft Windows, testatut ja toimivat ymp&auml;rist&ouml;t ovat Windows 98, ME, 2000 and XP.
<li>10 megatavua vapaata levytilaa
<li>V&auml;hint&auml;&auml;n 800 MHz prosessori, nopeampi on parempi (<u>voi</u> toimia my&ouml;s hitaammalla prosessorilla)
<li>V&auml;hint&auml;&auml;n 64 megatavua keskusmuistia, enemm&auml;n on parempi (<u>voi</u> toimia my&ouml;s pienemm&auml;ll&auml; m&auml;&auml;r&auml;ll&auml;)
<li>N&auml;yt&ouml;nohjain joka pystyy 1024x768 n&auml;ytt&ouml;tarkkuuteen 16-bittisen&auml; (ainakin 4 megatavua n&auml;ytt&ouml;muistia). <b>Suositeltava resoluutio 1280x1024</b> tai suurempi.
</ul>
<p>
<b>Valinnainen:</b> 
<br>
Windows-yhteensopiva &auml;&auml;nikortti

<h2><a name="prob">TUNNETUT ONGELMAT</H2>
<table border>
<tr>
<td bgcolor="#CCCCCC" width="50%">
Ongelma
</td>
<td  bgcolor="#CCCCCC" width="50%">
Ratkaisu
</td>
</tr>

<tr>
<td valign="top">Windows ME:ss&auml; (ja mahdollisesti 98:ssa) k&auml;y joskus niin ett&auml; pelin k&auml;ynnistyess&auml; hiiren kohdistinta ei n&auml;y, tai n&auml;kyy kaksi eriv&auml;rist&auml; kohdistinta.</td>
<td valign="top">Paina Esc:i&auml; jolloin ohjelma loppuu ja k&auml;ynnist&auml; ohjelma uudelleen.</td>
</tr>
<tr>
<td valign="top">
Peli toimii hitaasti r&auml;j&auml;ytysten aikana
</td>
<td valign="top">
<b>N&auml;yt&auml; p&ouml;ly</b> -asetus kannattaa ottaa pois p&auml;&auml;lt&auml; <b>Asetukset</b>-valikosta. 16-bittisen n&auml;ytt&ouml;tilan k&auml;ytt&auml;minen nopeuttaa toimintaa.
</td>
</tr>

</table>

<h2><a name="tm">TAVARAMERKIT</H2>
<ul>
<li>Microsoft Windows on Microsoftin tavaramerkki
</ul>

<h2><a name="credits">KIITOKSET</H2>
<ul>
<li>Simple Directmedia Layer (SDL) grafiikan, kontrollien ja &auml;&auml;nen tuotto: <a href="http://www.libsdl.org">http://www.libsdl.org</a>
<li>L&auml;hdekoodi &auml;&auml;nentoistoon: <a href="http://docs.mandragor.org/">http://docs.mandragor.org/</a>
<li>Tiedostonpakkauksen koodi: <a href="http://www.zlib.net/">http://www.zlib.net/</a>

<li>&Auml;&auml;niefektit:
<ul>
<li><a href="http://www.acoustica.com/">http://www.acoustica.com/</a>
<li><a href="http://www.koumis.com/">http://www.koumis.com/</a>
<li><a href="http://www.ljudo.com/">http://www.ljudo.com/</a>
<li><a href="http://www.partnersinrhyme.com/">http://www.partnersinrhyme.com/</a>
</ul>

<li>Ideoita grafiikkaan: poddster@blueyonder.co.uk
<li>Pelin kuvake: Andrew Munford
<li>Petri Nyman: alkuper&auml;inen idea (1985)
<li>Beta-testaajat:
<ul>
<li>Darren
<li>fireball@mytrashmail.com
<li>Jaztee@gmail.com
<li>Jussi Pakkanen
<li>Andrew Munford
<li>_Sisu_
<li>ikozlov@gmail.com 
<li>Mikis Hanenkamp
<li>Michael Reed
</ul>
</ul>


<div class="update">
Sivua p&auml;ivitetty 1.2.2007
</div>
</div>

</body></html>
